## Eleman İşlemleri

In [2]:
import pandas as pd

In [3]:
import numpy as np

In [4]:
s1 = np.random.randint(10, size = 5)
s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)

In [5]:
sozluk = {"var1": s1, "var2": s2, "var3": s3}

In [6]:
sozluk

{'var1': array([5, 5, 5, 7, 8]),
 'var2': array([9, 1, 3, 4, 2]),
 'var3': array([5, 6, 4, 6, 8])}

In [7]:
df = pd.DataFrame(sozluk)

In [8]:
df

   var1  var2  var3
0     5     9     5
1     5     1     6
2     5     3     4
3     7     4     6
4     8     2     8

In [9]:
df[:1]

   var1  var2  var3
0     5     9     5

In [10]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [11]:
df.index = ["a","b","c","d","e"]

In [12]:
df

   var1  var2  var3
a     5     9     5
b     5     1     6
c     5     3     4
d     7     4     6
e     8     2     8

In [14]:
df["c":"e"]

   var1  var2  var3
c     5     3     4
d     7     4     6
e     8     2     8

In [15]:
# silme işlemi yapma

In [16]:
df.drop("a", axis = 0)

   var1  var2  var3
b     5     1     6
c     5     3     4
d     7     4     6
e     8     2     8

In [17]:
df
# gözlemleneceği üzere dt üzerinde bir değişiklik olmadı.

   var1  var2  var3
a     5     9     5
b     5     1     6
c     5     3     4
d     7     4     6
e     8     2     8

In [18]:
# kalıcı silme : inplace = True

df.drop("a", axis = 0, inplace = True)

In [19]:
df

   var1  var2  var3
b     5     1     6
c     5     3     4
d     7     4     6
e     8     2     8

In [20]:
# fancy ile iki aralık arasında değer silelim

In [21]:
l = ["c","e"]

df.drop(l, axis = 0)

   var1  var2  var3
b     5     1     6
d     7     4     6

In [24]:
# değişkenler için : var mı bu?
"var1" in df

True

In [23]:
df

   var1  var2  var3
b     5     1     6
c     5     3     4
d     7     4     6
e     8     2     8

In [25]:
l = ["var1","var4","var2"]

In [27]:
# df içinde gez. varsa true yoksa false dön
for i in l:
    print(i in df)

True
False
True

In [28]:
df

   var1  var2  var3
b     5     1     6
c     5     3     4
d     7     4     6
e     8     2     8

In [29]:
df["var4"] = df["var1"] / df["var2"]

In [30]:
df

   var1  var2  var3      var4
b     5     1     6  5.000000
c     5     3     4  1.666667
d     7     4     6  1.750000
e     8     2     8  4.000000

In [31]:
# değişken silme

In [32]:
df.drop("var4", axis = 1)

   var1  var2  var3
b     5     1     6
c     5     3     4
d     7     4     6
e     8     2     8

In [33]:
df

   var1  var2  var3      var4
b     5     1     6  5.000000
c     5     3     4  1.666667
d     7     4     6  1.750000
e     8     2     8  4.000000

In [34]:
# kalici olarak sil
df.drop("var4", axis = 1, inplace = True)

In [35]:
df

   var1  var2  var3
b     5     1     6
c     5     3     4
d     7     4     6
e     8     2     8

In [36]:
# Yine fancy kullanarak silebiliriz

l = ["var1","var2"]
df.drop(l, axis = 1)

   var3
b     6
c     4
d     6
e     8